DataProcessors/ТК_ФормированиеННизЗКС_0109.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ТК_ФормированиеННизЗКС_0109</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТоварыВыгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИД_Строки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>55</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодУКТВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Comment>Ставка налога на добавленную стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЕИ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МРЦ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Comment>Вид контрагента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквзита ЮрФизЛицо.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельстваПлательщикаНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПлательщикаНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФилиала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GLN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Используется при анализе первичного интереса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Дополнительная информация о контрагенте</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодWERA</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаРаботы</Name>
					<Comment>1 - Корректировка 2 - Замена накладных</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьПротоколыЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительИмпортерТабак</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Comment>Тип</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Comment>Вид</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ТК_ФормированиеННизЗКС_0109/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("D100434");
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидыННПоУмолчанию();
	
	ОтразитьТоварыТекущейСтроки();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ТекущееДействие = "Выгрузить" Тогда 
		
		//ПроверяемыеРеквизиты.Добавить("КаталогВыгрузки");
		
	ИначеЕсли ТекущееДействие = "ОбновитьСписок" Тогда 
		
		ПроверяемыеРеквизиты.Добавить("Организация");				
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКаталогаДокументовЗавершение", ЭтаФорма);
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);		
	ДиалогОткрытия.Заголовок = НСтр("ru = 'Выберите каталог сохранения .XML файлов'; uk = 'Оберіть каталог збереження .XML файлів'");
	ДиалогОткрытия.Каталог = КаталогВыгрузки;
	
	ДиалогОткрытия.Показать(ОписаниеОповещения);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаДокументовЗавершение(ИмяКаталога, ДопПараметры) Экспорт 
	
	Если ТипЗнч(ИмяКаталога) = Тип("Массив") И ИмяКаталога.Количество() > 0 Тогда 
		КаталогВыгрузки = ИмяКаталога[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоННПриАктивизацииСтроки(Элемент)
	
	//ПодключитьОбработчикОжидания("ОтразитьТоварыТекущейСтроки", 0.3, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыНалоговыхНакладныхПометкаПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьВидимостьЭлементов", 0.2, Истина);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	ОчиститьСообщения();
	
	ТекущееДействие = "ОбновитьСписок";
	
	Если ПроверитьЗаполнение() Тогда
		ЗапуститьОперацию();
	КонецЕсли;
	
	ТекущееДействие = "";
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ОчиститьСообщения();
	
	ТекущееДействие = "СоздатьДокументы";
	
	Если ПроверитьЗаполнение() Тогда 
		ЗапуститьОперацию();
	КонецЕсли;
	
	ТекущееДействие = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьННвXML(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	ТекущееДействие = "Выгрузить";
	
	СтруктураВидовНН = ПолучитьСтруктуруВидовНН(Отказ);
	
	Если ПроверитьЗаполнение() И Не Отказ Тогда 		
		СохранитьФайлыНН(СтруктураВидовНН);
	КонецЕсли;
	
	ТекущееДействие = "";	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВБухгалтерию(Команда)
	
	Результат = ВыгрузитьВБухгалтериюНаСервере();	
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Выгрузка в бухгалтерию'"),,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Выгружено %1 документов'"),
			Результат.Выгружено));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьННБезНДСПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры


#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапуститьОперацию()
	
	Отказ = Ложь;
	СтруктураВидовНН = ПолучитьСтруктуруВидовНН(Отказ);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Неопределено;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.НавигационнаяСсылка = "e1cib/app/Обработка.ТК_ФормированиеННизЗКС_0109";
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Интервал = 2;	

	Если ТекущееДействие = "ОбновитьСписок" Тогда 
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Обновления списка налоговых накладных'; uk = 'Оновлення списку податкових накладних'"); 		
	ИначеЕсли ТекущееДействие = "СоздатьДокументы" Тогда 
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Создание налоговых накладных'; uk = 'Створення податкових накладних'"); 		
	ИначеЕсли ТекущееДействие = "Выгрузить" Тогда 
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выгрузка налоговых накладных в XML'; uk = 'Вивантаження податкових накладних в XML'"); 		
	Иначе
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = НачатьВыполнениеОперации(СтруктураВидовНН);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеЗавершенияДлительнойОперации", ЭтотОбъект, ТекущееДействие);		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);	
	
КонецПроцедуры

&НаСервере
Функция НачатьВыполнениеОперации(СтруктураВидовНН)
	
	Перем ДлительнаяОперация;
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ДатаНачала", Период.ДатаНачала);
	ПараметрыОперации.Вставить("ДатаОкончания", Период.ДатаОкончания);
	ПараметрыОперации.Вставить("Организация", Организация);
	ПараметрыОперации.Вставить("ОрганизацияФС", Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("eb5c09df-0b80-11e6-80bf-005056a71b84")));
	ПараметрыОперации.Вставить("Контрагент", Контрагент);
	ПараметрыОперации.Вставить("КаталогВыгрузки", КаталогВыгрузки);
	ПараметрыОперации.Вставить("СтруктураВидовНН", СтруктураВидовНН);
	ПараметрыОперации.Вставить("ПерезаполнитьНН", ПерезаполнитьНН);

	ДеревоЗначений 	= РеквизитФормыВЗначение("ДеревоНН", Тип("ДеревоЗначений"));		
	ДеревоМРЦ	 	= РеквизитФормыВЗначение("ДеревоННМРЦ", Тип("ДеревоЗначений"));
	ДеревоБезНДС 	= РеквизитФормыВЗначение("ДеревоННБезНДС", Тип("ДеревоЗначений"));
	ДеревоКомпенс 	= РеквизитФормыВЗначение("ДеревоННКомпенсирующие", Тип("ДеревоЗначений"));
	
	Приложения2 	= ТаблицаП2кНН.Выгрузить();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Если ТекущееДействие = "ОбновитьСписок" Тогда 
		
		ДеревоНН.ПолучитьЭлементы().Очистить();
		ДеревоННМРЦ.ПолучитьЭлементы().Очистить();
		ДеревоННБезНДС.ПолучитьЭлементы().Очистить();
		ДеревоННКомпенсирующие.ПолучитьЭлементы().Очистить();
		
		Приложения2.Очистить();
		
		ДеревоЗначений.Строки.Очистить();
		ДеревоМРЦ.Строки.Очистить();
		ДеревоБезНДС.Строки.Очистить();
		ДеревоКомпенс.Строки.Очистить();
		
		ТаблицаП2кНН.Очистить();		
		Объект.ТоварыВыгрузки.Очистить();
		
		
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
								ПараметрыВыполнения, 
								"Обработки.ТК_ФормированиеННизЗКС_0109.ПолучитьСпискиНалоговыхНакладных",
								ДеревоЗначений,
								ДеревоМРЦ,
								ДеревоБезНДС,
								ДеревоКомпенс,
								Приложения2,
								ПараметрыОперации);
								
	ИначеЕсли ТекущееДействие = "СоздатьДокументы" Тогда 
		
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
								ПараметрыВыполнения,
								"Обработки.ТК_ФормированиеННизЗКС_0109.СоздатьНалоговыеНакладные",
								ДеревоЗначений,
								ДеревоМРЦ,
								ДеревоБезНДС,
								ДеревоКомпенс,
								Приложения2,
								ПараметрыОперации);
								
	ИначеЕсли ТекущееДействие = "Выгрузить" Тогда 
		
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
								ПараметрыВыполнения, 
								"Обработки.ТК_ФормированиеННизЗКС_0109.ПолучитьВыгруженныеФайлы",
								ДеревоЗначений,
								ДеревоМРЦ,
								ДеревоБезНДС,
								Приложения2,
								ПараметрыОперации);
																																
	КонецЕсли;
	
	Возврат ДлительнаяОперация;
КонецФункции

&НаКлиенте
Процедура ПослеЗавершенияДлительнойОперации(Операция, Знач ВидОперации) Экспорт
		
	ОписаниеРезультата = ОбработатьРезультатОперации(Операция);
	
	ЕстьОшибки = ОписаниеРезультата.ЕстьОшибки;
	Ошибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеРезультата, "Ошибки", НСтр("ru = 'Обнаружена ошибка при выполнении операции'; uk = 'Виявлена помилка при виконанні операції'"));
	ОповещениеТекст = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеРезультата, "ОповещениеТекст", НСтр("ru = 'Операция выполнена'; uk = 'Операція виконана'"));
	ОповещениеПояснение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеРезультата, "ОповещениеПояснение", НСтр(""));
	Картинка = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеРезультата, "Картинка", БиблиотекаКартинок.Информация32);	
	СообщенияПользователю = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеРезультата, "СообщенияПользователю", Неопределено);
	
	ПоказатьОповещениеПользователя(ОповещениеТекст, , ОповещениеПояснение, Картинка);
	
	Если Не ЕстьОшибки Тогда 
		
		Если ОписаниеРезультата.Свойство("МассивФайлов") Тогда 
			НачатьПолучениеФайловССервера(, ОписаниеРезультата.МассивФайлов, КаталогВыгрузки);
		КонецЕсли;
			
	ИначеЕсли ЕстьОшибки Тогда 		
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибки);

	Иначе
		
		Если ЕстьОшибки Тогда 
			ПоказатьПредупреждение(, Ошибки,, НСтр("ru = 'Ошибка операции'; uk = 'Помилка операції'"));	
		КонецЕсли;
	КонецЕсли;		
		
	   
КонецПроцедуры

&НаСервере
Функция ОбработатьРезультатОперации(Операция)

	ОповещениеТекст 	= "";
	ОповещениеПояснение = "";
	ЕстьОшибки 			= Ложь;
	Ошибки 				= "";
	Результат 			= Неопределено;
	Картинка			= Неопределено;
	
	ОписаниеРезультата = Новый Структура;
	
	Если Операция = Неопределено Тогда 
		
		ОповещениеТекст = НСтр("ru = 'Отмена операции'; uk = 'Відміна операції'");	
		ОповещениеПояснение = НСтр("ru = 'Операция отменена'; uk = 'Операція відмінена'");
		Картинка = БиблиотекаКартинок.Ошибка32;
		                                                  
	Иначе
		
		СтатусОперации = Операция.Статус;
		
		Если Операция.Свойство("АдресРезультата") И Не ПустаяСтрока(Операция.АдресРезультата) Тогда 						
			Результат = ПолучитьИзВременногоХранилища(Операция.АдресРезультата);				
		КонецЕсли;		
		
		Если СтатусОперации = "Выполнено" Тогда 		
			
			Если ТипЗнч(Результат) = Тип("Структура") Тогда 
				
				Если Результат.Свойство("ДеревоЗначений") Тогда 					
					ЗначениеВРеквизитФормы(Результат.ДеревоЗначений, "ДеревоНН");					
				КонецЕсли;
				
				Если Результат.Свойство("ДеревоННМРЦ") Тогда 					
					ЗначениеВРеквизитФормы(Результат.ДеревоННМРЦ, "ДеревоННМРЦ");					
				КонецЕсли;
				
				Если Результат.Свойство("ДеревоБезНДС") Тогда 
					ЗначениеВРеквизитФормы(Результат.ДеревоБезНДС, "ДеревоННБезНДС");
				КонецЕсли;
				
				Если Результат.Свойство("ДеревоКомпенсирующие") Тогда 
					ЗначениеВРеквизитФормы(Результат.ДеревоКомпенсирующие, "ДеревоННКомпенсирующие");
				КонецЕсли;
				
				Если Результат.Свойство("Товары") Тогда 					
					Объект.ТоварыВыгрузки.Загрузить(Результат.Товары);
				КонецЕсли;		
				
				Если Результат.Свойство("ТаблицаПриложения2") Тогда 
					ТаблицаП2кНН.Загрузить(Результат.ТаблицаПриложения2);
				КонецЕсли;
				
				Если Результат.Свойство("МассивФайлов") Тогда 
					ОписаниеРезультата.Вставить("МассивФайлов", Результат.МассивФайлов);
					ОповещениеТекст = НСтр("ru = 'Выгрузка в XML'; uk = 'Вивантаження у XML'");							
					ОповещениеПояснение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = 'Сохранено %1 файл(ов)'; uk = 'Збережено %1 файл(ів)'"),
											Результат.МассивФайлов.Количество());				
				КонецЕсли;

			КонецЕсли;						
												
			Картинка = БиблиотекаКартинок.Успешно32;
						
		ИначеЕсли СтатусОперации = "Ошибка" Тогда 	
			
			ОповещениеТекст = НСтр("ru = 'Ошибка операции'; uk = 'Помилка операції'");
			Картинка = БиблиотекаКартинок.Ошибка32;
			ЕстьОшибки = Истина;
			
			ОповещениеПояснение = НСтр("ru = 'Операция не выполнена'; uk = 'Операція не виконана'");				
			Ошибки = Операция.КраткоеПредставлениеОшибки;
			
		Иначе			
			
			ЕстьОшибки = Истина;
		
		КонецЕсли;
		
		Если Операция.Свойство("Сообщения") И ТипЗнч(Операция.Сообщения) = Тип("ФиксированныйМассив") Тогда 
			Для Каждого Сообщение Из Операция.Сообщения Цикл 
				Сообщение.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("СообщенияПользователю") Тогда 
			СообщенияПользователю = Результат.СообщенияПользователю;
		КонецЕсли;		
	КонецЕсли;
	
	//Добавил условие, так как при формировании xml  очищался массив файлов
	Если  НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		ОписаниеРезультата = Новый Структура;
	КонецЕсли;
	
	ОписаниеРезультата.Вставить("ЕстьОшибки", ЕстьОшибки);
	
	Если Не ПустаяСтрока(Ошибки) Тогда 
		ОписаниеРезультата.Вставить("Ошибки", Ошибки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Картинка) Тогда 
		ОписаниеРезультата.Вставить("Картинка", Картинка);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ОповещениеТекст) Тогда 
		ОписаниеРезультата.Вставить("ОповещениеТекст", ОповещениеТекст);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ОповещениеПояснение) Тогда 
		ОписаниеРезультата.Вставить("ОповещениеПояснение", ОповещениеПояснение);
	КонецЕсли;
	
	Если ТипЗнч(СообщенияПользователю) = Тип("ФиксированныйМассив") Тогда 
		ОписаниеРезультата.Вставить("СообщенияПользователю", СообщенияПользователю);
	КонецЕсли;
	
	Возврат ОписаниеРезультата;		
КонецФункции


&НаКлиенте
Процедура СохранитьФайлыНН(СтруктураВидовНН)
	
	МассивФайлов = ПолучитьВыгруженныеФайлы(СтруктураВидовНН);
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов();
	ПараметрыДиалога.ВыборКаталога = Истина;

	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите каталог сохранения .XML файлов'; uk = 'Оберіть каталог збереження .XML файлів'");
	
	НачатьПолучениеФайловССервера(МассивФайлов, ПараметрыДиалога);	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлыНН_Старый()
	
	ВсеОк = Истина;
	МассивФайлов = ПолучитьВыгруженныеФайлы(Неопределено);
	УдаленоФайлов = 0;
	
	Если МассивФайлов <> Неопределено И МассивФайлов.Количество() > 0 Тогда 
		
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект);
		Для Каждого Файл Из МассивФайлов Цикл
			Путь = КаталогВыгрузки+"\"+Файл.Имя;
			НачатьПолучениеФайлаССервера(Оп, Файл.Хранение, Путь);
		КонецЦикла;		
		
		//НачатьПолучениеФайловССервера(, МассивФайлов, КаталогВыгрузки);	
		//		
		Для Каждого ОписаниеФайла Из МассивФайлов Цикл 
			Попытка
				УдалитьИзВременногоХранилища(ОписаниеФайла.Хранение);
				УдаленоФайлов = УдаленоФайлов + 1;
			Исключение
			КонецПопытки;
		КонецЦикла;		
	Иначе
		ВсеОк = Ложь;
	КонецЕсли;
	
	Если ВсеОк Тогда 
		Картинка = БиблиотекаКартинок.Успешно32;
		ОповещениеТекст = НСтр("ru = 'Успешно выгружено'; uk = 'Успішно вивантажено'");
		ОповещениеПояснение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Выгружено %1 файлов'; uk = 'Вивантажено %1 файлів'"),
								МассивФайлов.Количество());
	Иначе
		Картинка = БиблиотекаКартинок.Ошибка32;
		ОповещениеТекст = НСтр("ru = 'Отмена операции'; uk = 'Відміна операції'");	
		ОповещениеПояснение = НСтр("ru = 'Файлы не выгружены'; uk = 'Файли не вивантажені'");		
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(ОповещениеТекст, , ОповещениеПояснение, Картинка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОкончания(ПолученныйФайл, Параметры) Экспорт
КонецПроцедуры


&НаСервере
Функция ПолучитьВыгруженныеФайлы(СтруктураВидовНН)
		
	
	//ПараметрыОперации.Вставить("ДатаНачала", Период.ДатаНачала);
	//ПараметрыОперации.Вставить("ДатаОкончания", Период.ДатаОкончания);
	//ПараметрыОперации.Вставить("Организация", Организация);
	//ПараметрыОперации.Вставить("Контрагент", Контрагент);
	//ПараметрыОперации.Вставить("ПерезаполнитьНН", ПерезаполнитьНН);
	//ПараметрыОперации.Вставить("СоздаватьННБезНДС", СоздаватьННБезНДС);

	ДеревоЗначений 	= РеквизитФормыВЗначение("ДеревоНН", Тип("ДеревоЗначений"));		
	ДеревоМРЦ 		= РеквизитФормыВЗначение("ДеревоННМРЦ", Тип("ДеревоЗначений"));		
	ДеревоБезНДС 	= РеквизитФормыВЗначение("ДеревоННБезНДС", Тип("ДеревоЗначений"));
	ДеревоКомпенс 	= РеквизитФормыВЗначение("ДеревоННКомпенсирующие", Тип("ДеревоЗначений"));
	
	//Объект.ТоварыВыгрузки.Выгрузить(), 
	МассивФайлов = Обработки.ТК_ФормированиеННизЗКС_0109.ПолучитьВыгруженныеФайлы(ДеревоЗначений, ДеревоМРЦ, ДеревоБезНДС, ДеревоКомпенс, ТаблицаП2кНН.Выгрузить(), СтруктураВидовНН);
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоНН");
	ЗначениеВРеквизитФормы(ДеревоБезНДС, "ДеревоННБезНДС");
	
	Возврат МассивФайлов;
		
КонецФункции

&НаСервере
Функция ВыгрузитьВБухгалтериюНаСервере()
	
	Выгружено = 0;
	
	ПланОбмена = ПланыОбмена.ОбменБухгалтерия.НайтиПоКоду("BUH");
	
	Для Каждого СтрОрганизация Из ДеревоНН.ПолучитьЭлементы() Цикл 
		Для Каждого СтрДата Из СтрОрганизация.ПолучитьЭлементы() Цикл 
			Если Не СтрДата.ДокументНН.Пустая() Тогда 				
				ПланыОбмена.ЗарегистрироватьИзменения(ПланОбмена, СтрДата.ДокументНН);
				Выгружено = Выгружено + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрОрганизация Из ДеревоННМРЦ.ПолучитьЭлементы() Цикл 
		Для Каждого СтрДата Из СтрОрганизация.ПолучитьЭлементы() Цикл 
			Если Не СтрДата.ДокументНН.Пустая() Тогда 				
				ПланыОбмена.ЗарегистрироватьИзменения(ПланОбмена, СтрДата.ДокументНН);
				Выгружено = Выгружено + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//Если СоздаватьННБезНДС Тогда 
		Для Каждого СтрОрганизация Из ДеревоННБезНДС.ПолучитьЭлементы() Цикл 
			Для Каждого СтрДата Из СтрОрганизация.ПолучитьЭлементы() Цикл 
				Если Не СтрДата.ДокументНН.Пустая() Тогда 				
					ПланыОбмена.ЗарегистрироватьИзменения(ПланОбмена, СтрДата.ДокументНН);
					Выгружено = Выгружено + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	//КонецЕсли;
	
	Для Каждого Стр Из ТаблицаП2кНН Цикл 
		Если Не Стр.Документ.Пустая() Тогда 
			ПланыОбмена.ЗарегистрироватьИзменения(ПланОбмена, Стр.Документ);
			Выгружено = Выгружено + 1;
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("Выгружено", Выгружено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти



#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьСтруктуруВидовНН(Отказ = Ложь)
	
	СтруктураВидовНН = Новый Структура;	
	Для Каждого ВидНН Из ВидыНалоговыхНакладных Цикл 
		Если ВидНН.Пометка Тогда 
			СтруктураВидовНН.Вставить(ВидНН.Значение);
		КонецЕсли;
	КонецЦикла;	

	Если СтруктураВидовНН.Количество() = 0 Тогда 
		ПоказатьПредупреждение(, НСтр("ru = 'Нет выбранных видов налоговых накладных'; uk = 'Немає обраних видів податкових накладних'"));
		Отказ = Истина;
	КонецЕсли;
	
	Возврат СтруктураВидовНН;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидыННПоУмолчанию()
	
	ВидыНалоговыхНакладных.Добавить("НалоговыеИзЗКС", НСтр("ru = 'Налоговые накладные (ЗКС)'"), Истина);
	ВидыНалоговыхНакладных.Добавить("НалоговыеИзЗКСМРЦ", НСтр("ru = 'Налоговые накладные (ЗКС МРЦ)'"), Истина);
	ВидыНалоговыхНакладных.Добавить("НалоговыеБезНДС", НСтр("ru = 'Налоговые накладные (Без НДС)'"), Истина);
	
	//ВидыНалоговыхНакладных.Добавить("НалоговыеКомпенсирующие", НСтр("ru = 'Налоговые накладные (Компенсирующие)'"), Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьТоварыТекущейСтроки()
	
	ТекущаяСтрока = Элементы.ДеревоНН.ТекущиеДанные;
	ГруппаТовары = Элементы.ГруппаТовары;
	
	Если ТекущаяСтрока = Неопределено ИЛИ Не ЗначениеЗаполнено(ТекущаяСтрока.ИД_Строки) Тогда 
		ГруппаТовары.Видимость = Ложь;
	Иначе
		ГруппаТовары.Видимость = Истина;	
		
		Отбор = Новый Структура("ИД_Строки", ТекущаяСтрока.ИД_Строки);
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
		
		мСтрок = Объект.ТоварыВыгрузки.НайтиСтроки(Отбор);		
		ГруппаТовары.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Товары (%1)'; uk = 'Товари (%1)'"),
									мСтрок.Количество());
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("СтраницаНН");
	МассивЭлементов.Добавить("СтраницаННМРЦ");
	МассивЭлементов.Добавить("СтраницаННБезНДС");
	МассивЭлементов.Добавить("СтраницаННКомпенсирующие");
	МассивЭлементов.Добавить("СтраницаП2кНН");
	
	МассивВидимыхЭлементов = Новый Массив;
	
	Для Каждого ВидНН Из ВидыНалоговыхНакладных Цикл 
		Если ВидНН.Пометка Тогда 
			Если ВидНН.Значение = "НалоговыеИзЗКС" Тогда 
				МассивВидимыхЭлементов.Добавить("СтраницаНН");
				МассивВидимыхЭлементов.Добавить("СтраницаП2кНН");
			ИначеЕсли ВидНН.Значение = "НалоговыеИзЗКСМРЦ" Тогда 
				МассивВидимыхЭлементов.Добавить("СтраницаННМРЦ");
				МассивВидимыхЭлементов.Добавить("СтраницаП2кНН");
			ИначеЕсли ВидНН.Значение = "НалоговыеБезНДС" Тогда 
				МассивВидимыхЭлементов.Добавить("СтраницаННБезНДС");
				МассивВидимыхЭлементов.Добавить("СтраницаП2кНН");							
			ИначеЕсли ВидНН.Значение = "НалоговыеКомпенсирующие" Тогда 
				МассивВидимыхЭлементов.Добавить("СтраницаННКомпенсирующие");
			КонецЕсли;
		КонецЕсли;				
	КонецЦикла;
	
	ОбщегоНазначенияТККлиентСервер.УстановитьВидимостьЭлементовПоМассиву(
		Элементы, 
		МассивЭлементов, 
		ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивВидимыхЭлементов));
	
КонецПроцедуры


#КонецОбласти
